package ru.gritsenkodaniil.bankaccountmanagement;

/**
 * Перечисление статусов операций.
 */
public enum OperationStatus {
    UNCOMMITTED("Не подтверждена"),
    COMMITTED("Подтверждена"),
    CANCELED("Отменена");

    private final String title;

    // -----------------------------------------------------------------------------------------------------------------
    // CONSTRUCTORS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Создает новый статус операции.
     * @param title название статуса
     */
    OperationStatus(String title) {
        this.title = title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // GETTERS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Возвращает название статуса.
     * @return название
     */
    public String getTitle() {
        return title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // METHODS. GETTING DATA
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Проверяет, подтверждена ли операция.
     * @return true если подтверждена, иначе false
     */
    public boolean isCommitted() {
        return this == COMMITTED;
    }
}