package ru.gritsenkodaniil.bankaccountmanagement;

public enum OperationStatus {
    COMMITTED("Подтверждена"),
    CANCELED("Отменена");

    private final String title;

    // -----------------------------------------------------------------------------------------------------------------
    // CONSTRUCTORS
    // -----------------------------------------------------------------------------------------------------------------

    OperationStatus(String title) {
        this.title = title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // GETTERS
    // -----------------------------------------------------------------------------------------------------------------

    public String getTitle() {
        return title;
    }
}
