package ru.gritsenkodaniil.bankaccountmanagement;

public enum OperationType {
    DEPOSIT("Внутренний перевод"),
    CREDIT("Поступление"),
    DEBIT("Списание"),
    WITHDRAW("Снятие наличных"),
    TRANSFER("Перевод");

    private final String title;

    // -----------------------------------------------------------------------------------------------------------------
    // CONSTRUCTORS
    // -----------------------------------------------------------------------------------------------------------------

    OperationType(String title) {
        this.title = title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // GETTERS
    // -----------------------------------------------------------------------------------------------------------------

    public String getTitle() {
        return title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // METHODS. GETTING DATA
    // -----------------------------------------------------------------------------------------------------------------

    public boolean hasBeneficiary() {
        return this == DEBIT || this == TRANSFER;
    }

    public boolean isAddition() {
        return this == DEPOSIT || this == CREDIT;
    }
}