package ru.gritsenkodaniil.bankaccountmanagement;

/**
 * Перечисление типов операций.
 */
public enum OperationType {
    DEPOSIT("Внутренний перевод"),
    CREDIT("Поступление"),
    DEBIT("Списание"),
    WITHDRAW("Снятие наличных"),
    TRANSFER("Перевод");

    private final String title;

    // -----------------------------------------------------------------------------------------------------------------
    // CONSTRUCTORS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Создает новый тип операции.
     * @param title название типа
     */
    OperationType(String title) {
        this.title = title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // GETTERS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Возвращает название типа операции.
     * @return название
     */
    public String getTitle() {
        return title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // METHODS. GETTING DATA
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Проверяет, требует ли операция указания бенефициара.
     * @return true если требуется, иначе false
     */
    public boolean hasBeneficiary() {
        return this == DEBIT || this == TRANSFER;
    }

    /**
     * Проверяет, является ли операция пополнением счета.
     * @return true если пополнение, иначе false
     */
    public boolean isAddition() {
        return this == DEPOSIT || this == CREDIT;
    }
}