package ru.dgritsenko.bam.userinterface;

import java.text.MessageFormat;

public enum ChoosingOption {
    DEFAULT("Введите номер действия"),
    ACCOUNT("Введите номер счета в списке"),
    OPERATION_AMOUNT("Введите сумму операции");

    private final String title;

    // -----------------------------------------------------------------------------------------------------------------
    // OVERRIDDEN
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Возвращает строковое представление опции.
     * @return title
     */
    @Override
    public String toString() {
        return getTitle();
    }

    // -----------------------------------------------------------------------------------------------------------------
    // CONSTRUCTORS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Создает новую опцию.
     * @param title заголовок опции
     */
    ChoosingOption(String title) {
        this.title = MessageFormat.format("> {0}: ", title);
    }

    // -----------------------------------------------------------------------------------------------------------------
    // GETTERS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Возвращает заголовок опции.
     * @return название
     */
    public String getTitle() {
        return title;
    }
}
