package ru.dgritsenko.bam.userinterface;

public enum Page {
    MAIN("Главная"),
    ACCOUNTS("Счета"),
    ACCOUNTS_CREATING("Создание счета"),
    ACCOUNTS_LIST("Список счетов"),
    ACCOUNTS_OPERATION("Операции счета"),
    TRANSACTIONS("Транзакции"),
    TRANSACTIONS_LIST("Список транзакций"),
    TEST("Тест"),
    EXIT("Завершение работы");

    private final String title;

    // -----------------------------------------------------------------------------------------------------------------
    // OVERRIDDEN
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Возвращает строковое представление страницы.
     * @return title
     */
    @Override
    public String toString() {
        return getTitle();
    }

    // -----------------------------------------------------------------------------------------------------------------
    // CONSTRUCTORS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Создает новую страницу.
     * @param title название статуса
     */
    Page(String title) {
        this.title = title;
    }

    // -----------------------------------------------------------------------------------------------------------------
    // GETTERS
    // -----------------------------------------------------------------------------------------------------------------

    /**
     * Возвращает заголовок страницы.
     * @return название
     */
    public String getTitle() {
        return title;
    }
}
